In [1]:
# Pandas DataFrame

In [3]:
# import packages
import pandas as pd
import numpy as np
test =[1,2,3,4,5]
df = pd.DataFrame(test)
df

   0
0  1
1  2
2  3
3  4
4  5

In [5]:
## Creating a Table
table = [['srinu',25],['kishore',26],['mani',27],['ratna',28]]
df = pd.DataFrame(table,columns =['Name','Age'])
df

      Name  Age
0    srinu   25
1  kishore   26
2     mani   27
3    ratna   28

In [7]:
table1 = {'Name':['srinu','kishore','mani','ratna'],'Age':[25,26,27,28]}
df = pd.DataFrame(table1,index=[1,2,3,4])
df

      Name  Age
1    srinu   25
2  kishore   26
3     mani   27
4    ratna   28

In [9]:
## Columns Selection , deletion , addition
df['weight'] = pd.Series([65,75,85,90],index = [1,2,3,4])

df

      Name  Age  weight
1    srinu   25      65
2  kishore   26      75
3     mani   27      85
4    ratna   28      90

In [9]:
df['height'] = pd.Series([150,151,152,153],index = [1,2,3,4])
df

      Name  Age  height
1    srinu   25     150
2  kishore   26     151
3     mani   27     152
4    ratna   28     153

In [13]:
# creating the table
table12 = {'Name':['srinu','kishore','mani','ratna','ramu'],'Age':[25,26,27,28,29],'height':[151,152,153,154,155],'weight':[65,76,78,87,88]}
df = pd.DataFrame(table12,index=[1,2,3,4,5])

td = pd.DataFrame(df)
td

      Name  Age  height  weight
1    srinu   25     151      65
2  kishore   26     152      76
3     mani   27     153      78
4    ratna   28     154      87
5     ramu   29     155      88

In [14]:
# deleting the column
del td['Age']
td
# other method to delete the column
#td.pop('two')

      Name  height  weight
1    srinu     151      65
2  kishore     152      76
3     mani     153      78
4    ratna     154      87
5     ramu     155      88

In [15]:

td

      Name  height  weight
1    srinu     151      65
2  kishore     152      76
3     mani     153      78
4    ratna     154      87

In [20]:
# row selection
td.loc[3:4]
# giving the index number to select the particular Row

    Name  height  weight
3   mani     153      78
4  ratna     154      87

In [24]:
# multiple Selection
td[0:5]

      Name  height  weight
1    srinu     151      65
2  kishore     152      76
3     mani     153      78
4    ratna     154      87
5     ramu     155      88

In [20]:
# Addition of Rows to existing
df = pd.DataFrame([[1,2],[3,4]],columns=['a','b'])

In [21]:
df

   a  b
0  1  2
1  3  4

In [23]:
df2 = pd.DataFrame([[5,6],[7,8]],columns=['a','b'])
df2

   a  b
0  5  6
1  7  8

In [25]:
## To add rows
df = df.append(df2)
df

   a  b
0  1  2
1  3  4
0  5  6
1  7  8
0  5  6
1  7  8

In [25]:
# Deletion of rows
df = pd.DataFrame([[1,2],[3,4]],columns=['a','b'])
df2 = pd.DataFrame([[5,6],[7,8]],columns=['a','b'])
df = df.append(df2)
df
df.drop(1)

   a  b
0  1  2
0  5  6

In [38]:
td
td.head(2)

      Name  height  weight
1    srinu     151      65
2  kishore     152      76

In [39]:
td.tail(2)

    Name  height  weight
3   mani     153      78
4  ratna     154      87